app/views/articles/articles.html.erb

    <h5><%=c+1 %>. Blog Name - <%=  link_to b.name, "/blogs/#{b.name}" %></h5>
    <h5>Author: <%= link_to b.author.author_name,"/blogs/author/#{b.author.author_name}" if b.author && !b.author.author_name.blank? %></h5>
---
SELECT  `authors`.* FROM `authors` WHERE `authors`.`id` = 2 LIMIT 1