app/views/articles/show.html.erb

SELECT  `authors`.* FROM `authors` WHERE `authors`.`id` = 2 LIMIT 1
---
<h1><%= @r.category.category_name %></h1>
<h2><%= @r.author.author_name  if @r.author && !@r.author.author_name.blank?  %></h2>