app/controllers/articles_controller.rb

def index
     @post = Blog.all
---
SELECT `blogs`.* FROM `blogs`

def show
    pp "========#{params[:id]}"
    @r=Blog.find_by_name(params[:id])
---
SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`name` = 'Ruby' LIMIT 1