app/controllers/categories_controller.rb

  def categories_show
    @category = Category.find_by_category_name(params[:category_id])
    @blog= Blog.where(:category_id => @category.id)
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`category_name` = 'Front-end' LIMIT 1
SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`category_id` = 1